#+AUTHOR: Gianluca Marcon
#+TITLE: My Emacs configuration file
#+EMAIL: marcon.gluca@gmail.com
This file is formatted using org-mode, as explained in this [[https://harryrschwartz.com/2016/02/15/switching-to-a-literate-emacs-configuration][blog post.]]

** agenda
#+BEGIN_SRC emacs-lisp
    (setq org-agenda-files (list "~/Dropbox/org/work.org"
                                 "~/Dropbox/org/main.org"
                                   "~/Nextcloud/PhD/org/work.org"))

    (setq org-default-notes-file "~/Dropbox/PhD/org/notes.org")
#+END_SRC

#+RESULTS:
: ~/Dropbox/PhD/org/notes.org

**** Example
- =:results output= makes the =print= command work, otherwise the result will be "None"
- =:session= is used to have a persistent python session between python blocks (kinda like Jupyter Notebooks)
  
#+BEGIN_SRC python :results output :exports both
  def double_value(x):
      return 2*x

  print(double_value(20))
#+END_SRC

#+RESULTS:
: 40

